__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
V_Spectrograms (InputLayer)     (None, 10, 85, 36, 1 0                                            
__________________________________________________________________________________________________
C_Spectrograms (InputLayer)     (None, 10, 10, 277,  0                                            
__________________________________________________________________________________________________
V_L1 (TimeDistributed)          (None, 10, 81, 32, 6 1664        V_Spectrograms[0][0]             
__________________________________________________________________________________________________
C_L1 (TimeDistributed)          (None, 10, 6, 273, 6 1664        C_Spectrograms[0][0]             
__________________________________________________________________________________________________
V_L2 (TimeDistributed)          (None, 10, 79, 30, 3 18464       V_L1[0][0]                       
__________________________________________________________________________________________________
C_L2 (TimeDistributed)          (None, 10, 4, 271, 3 18464       C_L1[0][0]                       
__________________________________________________________________________________________________
time_distributed_25 (TimeDistri (None, 10, 19, 7, 32 0           V_L2[0][0]                       
__________________________________________________________________________________________________
time_distributed_28 (TimeDistri (None, 10, 1, 67, 32 0           C_L2[0][0]                       
__________________________________________________________________________________________________
time_distributed_26 (TimeDistri (None, 10, 19, 7, 32 0           time_distributed_25[0][0]        
__________________________________________________________________________________________________
time_distributed_29 (TimeDistri (None, 10, 1, 67, 32 0           time_distributed_28[0][0]        
__________________________________________________________________________________________________
time_distributed_27 (TimeDistri (None, 10, 4256)     0           time_distributed_26[0][0]        
__________________________________________________________________________________________________
time_distributed_30 (TimeDistri (None, 10, 2144)     0           time_distributed_29[0][0]        
__________________________________________________________________________________________________
Merger (Concatenate)            (None, 10, 6400)     0           time_distributed_27[0][0]        
                                                                 time_distributed_30[0][0]        
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 10, 100)      640100      Merger[0][0]                     
__________________________________________________________________________________________________
bidirectional_5 (Bidirectional) (None, 200)          160800      dense_39[0][0]                   
__________________________________________________________________________________________________
dense_40 (Dense)                (None, 128)          25728       bidirectional_5[0][0]            
__________________________________________________________________________________________________
dense_41 (Dense)                (None, 1)            129         dense_40[0][0]                   
==================================================================================================
Total params: 867,013
Trainable params: 867,013
Non-trainable params: 0
__________________________________________________________________________________________________
