_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 256, 131)          0         
_________________________________________________________________
dense_21 (Dense)             (None, 256, 128)          16896     
_________________________________________________________________
lstm_9 (LSTM)                (None, 256, 131)          136240    
_________________________________________________________________
lstm_10 (LSTM)               (None, 131)               137812    
_________________________________________________________________
dense_22 (Dense)             (None, 128)               16896     
_________________________________________________________________
dense_23 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_24 (Dense)             (None, 128)               16512     
_________________________________________________________________
dense_25 (Dense)             (None, 1)                 129       
=================================================================
Total params: 340,997
Trainable params: 340,997
Non-trainable params: 0
_________________________________________________________________
